In [1]:
# 쥬피터노트북 셀 스타일 조절 
from IPython.core.display import display, HTML
display(HTML("<style>.container { font-weight: bold !important; }</style>"))
display(HTML("<style>.container { width: 100% !important; }</style>"))

# 경고 메세지 숨기기 
import warnings
warnings.filterwarnings(action='ignore')

In [2]:
import pandas as pd
import numpy as np

# 자료형 변경 

- 묵시적 형변환 : 자동 => 정수 < 실수 < 문자
- 강제적 형변환 
```
실수 => 정수 
실수, 정수 => 문자열 
문자열숫자 => 숫자
    pd.to_numeric()
날짜스타일 문자열 2021-07-31, 20211126  => 시계열 데이타 
    pd.to_datetime()
```

In [6]:
# 10행 5열 
data = np.arange(1,51).reshape(-1 , 5)
columnsList = ['col'+str(i) for i in range(1,6)]
rowList = ['row'+str(i) for i in range(1,11)]
df1 = pd.DataFrame(data, columns=columnsList, index=rowList)
df1

       col1  col2  col3  col4  col5
row1      1     2     3     4     5
row2      6     7     8     9    10
row3     11    12    13    14    15
row4     16    17    18    19    20
row5     21    22    23    24    25
row6     26    27    28    29    30
row7     31    32    33    34    35
row8     36    37    38    39    40
row9     41    42    43    44    45
row10    46    47    48    49    50

In [7]:
df1.dtypes

col1    int32
col2    int32
col3    int32
col4    int32
col5    int32
dtype: object

In [8]:
# 실수형 데이타 삽입 => 값이 교체된 컬럼의 데이타형이 실수형으로 자동 변경 
df1.loc['row1', 'col1'] = 3.14
df1

        col1  col2  col3  col4  col5
row1    3.14     2     3     4     5
row2    6.00     7     8     9    10
row3   11.00    12    13    14    15
row4   16.00    17    18    19    20
row5   21.00    22    23    24    25
row6   26.00    27    28    29    30
row7   31.00    32    33    34    35
row8   36.00    37    38    39    40
row9   41.00    42    43    44    45
row10  46.00    47    48    49    50

In [9]:
df1.dtypes

col1    float64
col2      int32
col3      int32
col4      int32
col5      int32
dtype: object

In [12]:
# 문자형 데이타 삽입 => 값이 교체된 컬럼의 데이타형이 문자열형으로 자동 변경 
df1.loc['row1', 'col2'] = 'Python'
df1.loc['row1', 'col3'] = 'Python'
df1

        col1    col2    col3  col4  col5
row1    3.14  Python  Python     4     5
row2    6.00       7       8     9    10
row3   11.00      12      13    14    15
row4   16.00      17      18    19    20
row5   21.00      22      23    24    25
row6   26.00      27      28    29    30
row7   31.00      32      33    34    35
row8   36.00      37      38    39    40
row9   41.00      42      43    44    45
row10  46.00      47      48    49    50

In [13]:
df1.dtypes

col1    float64
col2     object
col3     object
col4      int32
col5      int32
dtype: object

In [15]:
# ValueError => astype(int)메서드를 사용할려면 컬럼값이 모두 숫자형태의 문자이어야한다. 
# df1['col3'].astype(int)

In [17]:
pd.to_numeric?

In [18]:
# errors='coerce' 만약 숫자문자가 아니라면 NaN 결측값 삽입 
pd.to_numeric(df1['col3'], errors='coerce')

row1      NaN
row2      8.0
row3     13.0
row4     18.0
row5     23.0
row6     28.0
row7     33.0
row8     38.0
row9     43.0
row10    48.0
Name: col3, dtype: float64

In [19]:
# 원본 컬럼에 결과값 반영 
df1['col3'] = pd.to_numeric(df1['col3'], errors='coerce')

In [20]:
df1.dtypes

col1    float64
col2     object
col3    float64
col4      int32
col5      int32
dtype: object

In [21]:
df1

        col1    col2  col3  col4  col5
row1    3.14  Python   NaN     4     5
row2    6.00       7   8.0     9    10
row3   11.00      12  13.0    14    15
row4   16.00      17  18.0    19    20
row5   21.00      22  23.0    24    25
row6   26.00      27  28.0    29    30
row7   31.00      32  33.0    34    35
row8   36.00      37  38.0    39    40
row9   41.00      42  43.0    44    45
row10  46.00      47  48.0    49    50

In [25]:
# 실수 => 정수 
df1['col1'].astype(int)

row1      3
row2      6
row3     11
row4     16
row5     21
row6     26
row7     31
row8     36
row9     41
row10    46
Name: col1, dtype: int32

In [26]:
# 원본에 반영 
df1['col1'] = df1['col1'].astype(int)

In [27]:
df1.dtypes

col1      int32
col2     object
col3    float64
col4      int32
col5      int32
dtype: object